Repository: danielgp/nis2mysql
Catalog: source/locale/*/LC_MESSAGES/nis_messages.po
Languages: ro_ro

# i18n_Feedback_AnalyzeImpossible
source: The MySQL %s cannot be analyzed due to missing MySQL conection! Please adjust your connection parameters (host: %s, port: %s, username: %s, database: %s) and try again...
ro_ro: %s din MySQL nu pot fi analizate datorită conexiunii ne-realizate! Ajustati parametrii de conectare (nume server = %s, port: %s, nume utilizator: %s, baza de date: %s) si încercați din nou...

# i18n_Feedback_ConnectionError
source: Connection error (no.: %d, message from server: %s, host = %s, port: %s, username: %s, database: %s)
ro_ro: Eroare la conectare (nr.: %d, mesaj de la server: %s, nume server = %s, port: %s, nume utilizator: %s, baza de date: %s)

# i18n_Feedback_Error
source: Error
ro_ro: Eroare

# i18n_Feedback_MultipleSelectionAdvise
source: For multiple choices hold down the Ctrl key
ro_ro: Pentru selecţie multiplă ţineţi apăsată tasta Ctrl

# i18n_Feedback_MySQL_DisplayedOnly
source: The query %s is desired to be displayed but not executed (%s)
ro_ro: Interogarea %s se doreşte a fi afişată dar nu şi executată (%s)

# i18n_Feedback_MySQL_Error
source: There was an error running the query %s on host: %s, port: %s as username: %s, feedback from server is: %s
ro_ro: A intervenit o eroare în executarea interogării %s pe serverul: %s, portul: %s ca şi utilizator: %s, mesajul de la server fiind: %s

# i18n_Feedback_MySQL_Executed
source: The query %s has been executed (%s, %d record(s) resulted)
ro_ro: Interogarea %s a fost executată (%s, rezultând %d înregistrări)

# i18n_Feedback_MySQL_ToBeExecuted
source: The query %s is desired to be executed (%s)
ro_ro: Interogarea %s se doreşte a fi executată (%s)

# i18n_Feedback_RunImpossible
source: The MySQL cannot run given query (%s) due to missing MySQL conection! Please adjust your connection parameters (host: %s, port: %s, username: %s, database: %s) and try again...
ro_ro: Serverul MySQL nu poate executa interogarea (%s) datorită conexiunii ne-realizate! Ajustati parametrii de conectare (nume server = %s, port: %s, nume utilizator: %s, baza de date: %s) si încercați din nou...

# i18n_Feedback_UndefinedAction
source: Action not defined...
ro_ro: Acţiune nedefinită...

# i18n_Feedback_UndefinedQuery
source: The MySQL query labeled %s is not defined...
ro_ro: Interogarea MySQL cu eticheta %s nu este definită...

# i18n_TabAction
source: Action
ro_ro: Acţiune

# i18n_TabAction_OptionList
source: List advanced structures by a chosen Definer
ro_ro: Listează structurile avansate după un autor (definer) ales

# i18n_TabAction_OptionModify
source: Modify Definer of advanced features
ro_ro: Modifică autorul (definer-ul) ales în structurile avansate

# i18n_TabAction_ChooseActionToTake
source: Choose your desired action to take
ro_ro: Alegeţi acţiunea dorită

# i18n_TabAction_IchoseProceed
source: I chose desired action to take, proceed!
ro_ro: Am ales acţiunea dorită, mai departe!

# i18n_TabAdvancedFeature
source: Choose advanced feature
ro_ro: Alege structura avansată

# i18n_TabAdvancedFeature_Choice_Events
source: Events (%d cases)
ro_ro: Evenimente (%d cazuri)

# i18n_TabAdvancedFeature_Choice_Routines
source: Routines (%d cases)
ro_ro: Rutine (%d cazuri)

# i18n_TabAdvancedFeature_Choice_Triggers
source: Triggers (%d cases)
ro_ro: Declanşatoare (%d cazuri)

# i18n_TabAdvancedFeature_Choice_Views
source: Views (%d cases)
ro_ro: Vizualizări (%d cazuri)

# i18n_TabAdvancedFeature_Choose
source: Choose one or more values from below list
ro_ro: Alege una sau mai mmulte structuri avansate din lista de mai jos

# i18n_TabAdvancedFeature_IchoseProceed
source: I chose, proceed!
ro_ro: Am ales, mai departe!

# i18n_TabAssesVariations
source: Assess variations
ro_ro: Analizează variaţiile

# i18n_TabAssesVariations_ChooseDatabases
source: Choose your databases of interest, in order to analyze the variations for the Definer
ro_ro: Alegeţi bazele de date de analizat pentru a analiza variaţiile Autorilor (Definer-ilor)

# i18n_TabAssesVariations_IchoseProceed
source: I chose my databases of interest, proceed!
ro_ro: Am ales bazele mele de date, mai departe!

# i18n_TabAssesVariations_NoValuesToChooseFrom
source: It seems you do not have any custom databases in chose MySQL instance [%s]... So this is an end road, nothing more to do from this point on!
ro_ro: Parese că nu aveţi nici o bază de date non-standard în instanţa MySQL aleasă [%s]... Asta înseamnă că am ajuns într-un punct mort din care nu se mai poate face nimic!

# i18n_TabDebug
source: Parameters for Debug
ro_ro: Parametrii pentru depanare

# i18n_TabServer_ChooseServerToConnectTo
source: Choose your MySQL server to connect to
ro_ro: Alegeţi serverul MySQL la care doriţi să vă conectaţi

# i18n_TabServer_IchoseProceed
source: I chose target MySQL server, proceed!
ro_ro: Am ales serverul MySQL, mai departe!

# i18n_TabVariations
source: Pick value from detected variations
ro_ro: Alege valoarea din variaţiile determinate

# i18n_TabVariations__ChooseValue
source: Choose a value from below list
ro_ro: Alege o valoare din lista de mai jos

# i18n_TabVariations__IchoseProceed
source: I chose desired value, proceed!
ro_ro: Am ales valoarea dorită, mai departe!

# i18n_TabVariations__NoValuesToChooseFrom
source: Selected database(s) does not contain any advanced features (event/stored function/stored procedure/trigger/view)... Therefore this is an end road, nothing more to do from this point on!
ro_ro: Bazele de date selectate nu conţin nici o structură avansată (eveniment/funcţie stocată/procedură stocată/declanşator/vizualizare)... Asta înseamnă că am ajuns într-un punct mort din care nu se mai poate face nimic!
